# frozen_string_literal: true

# Brewfile.personal - Personal-specific packages
#
# Usage: brew bundle --file=Brewfile.personal
#
# Note: Run after Brewfile.shared
#

# =============================================================================
# AI Coding Assistants
# =============================================================================

cask 'claude'
cask 'claude-code'
cask 'codex'
brew 'gemini-cli'

# =============================================================================
# Version Control
# =============================================================================

brew 'git-lfs'
brew 'pre-commit'

# =============================================================================
# Modern CLI Tools
# =============================================================================

brew 'btop'    # top
brew 'dua-cli' # du
brew 'duf'     # df
brew 'fzf'     # ctrl-r, fuzzy finder
brew 'gping'   # ping
brew 'tldr'    # man

# =============================================================================
# Languages: Clojure
# =============================================================================

tap 'borkdude/brew'
tap 'clojure/tools'

brew 'borkdude/brew/babashka'
brew 'borkdude/brew/clj-kondo'
brew 'clojure/tools/clojure'
brew 'leiningen'
brew 'planck'

# =============================================================================
# Languages: Java
# =============================================================================

cask 'temurin@21'

# =============================================================================
# Languages: Node
# =============================================================================

brew 'jslint4java'
brew 'nodenv'

# =============================================================================
# Languages: Ruby
# =============================================================================

brew 'libyaml'   # for Psych YAML parser
brew 'openssl@3' # for Ruby >= 3.1
brew 'rbenv'

# =============================================================================
# Languages: Python
# =============================================================================

brew 'pyenv'
brew 'uv'

# =============================================================================
# Data & Serialization
# =============================================================================

brew 'yq' # YAML

# =============================================================================
# Networking
# =============================================================================

brew 'awscli'
brew 'httpie'
cask 'ngrok'

# =============================================================================
# Security
# =============================================================================

brew 'gnupg'

# =============================================================================
# Development Tools
# =============================================================================

brew 'adr-tools'
brew 'cloc'
brew 'ctags'
cask 'docker-desktop'
brew 'markdownlint-cli'

# =============================================================================
# Shell Utilities
# =============================================================================

brew 'ack'
brew 'autoenv'
brew 'direnv'
brew 'rlwrap'

# =============================================================================
# Documentation
# =============================================================================

brew 'graphviz'
brew 'markdown'

# =============================================================================
# macOS Utilities
# =============================================================================

cask 'clipy'
brew 'dfu-util' # for flashing keyboard firmware

# =============================================================================
# Media: Video
# =============================================================================

cask 'filebot'
cask 'makemkv'
cask 'mkvtoolnix-app'

# =============================================================================
# Media: 3D
# =============================================================================

cask 'blender'
